Revit 2027 API
CoordinationModelLinkUtils.GetAllCoordinationModelTypeIds Method
 Gets all Coordination Model type ids in the document.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ISet<ElementId> GetAllCoordinationModelTypeIds(
	Document document
)
Public Shared Function GetAllCoordinationModelTypeIds (
	document As Document
) As ISet(Of ElementId)
public:
static ISet<ElementId^>^ GetAllCoordinationModelTypeIds(
	Document^ document
)
static member GetAllCoordinationModelTypeIds :
        document : Document -> ISet<ElementId>
Parameters
document Document
 The document.
Return Value
ISet<ElementId>
 Returns the set of element ids of all Coordination Model types in the document.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
See Also
Reference
CoordinationModelLinkUtils Class
Autodesk.Revit.DB.ExternalData Namespace